import './App.css';

function App() {
  return (
    <div className="App">
      <h1>Ход торгов Тестовые торги на аппарат ЛОТОС №2033564 (09.11.2020 07:00)</h1>
      <p>Уважаемые участники, во время вашего хода вы можете изменить параметры торгов, указанных в таблице:</p>

      <table className='aucTable'>
        <tr>
          <td> Ход </td>
          <td> *Таймер* </td>
          <td> *Таймер* </td>
          <td> *Таймер* </td>
          <td> *Таймер* </td>
        </tr>

        <tr>
          <td> Параметры и требования </td>
          <td> <p>Участник №1</p> <p>USERNAME</p> </td>
          <td> <p>Участник №2</p> <p>USERNAME</p> </td>
          <td> <p>Участник №3</p> <p>USERNAME</p> </td>
          <td> <p>Участник №4</p>  <p>USERNAME</p> </td>
        </tr>


        <tr>
          <td> Наличие комплекса мероприятий, повышающих стандарты качества изготовления </td>
          <td> - </td>
          <td> - </td>
          <td> - </td>
          <td> - </td>
        </tr>

        <tr>
          <td> Наличие комплекса мероприятий, повышающих стандарты качества изготовления </td>
          <td> 80 </td>
          <td> 90 </td>
          <td> 75 </td>
          <td> 120 </td>
        </tr>

        <tr>
          <td> Наличие комплекса мероприятий, повышающих стандарты качества изготовления </td>
          <td> 24 </td>
          <td> 24 </td>
          <td> 22 </td>
          <td> 36 </td>
        </tr>

        <tr>
          <td> Наличие комплекса мероприятий, повышающих стандарты качества изготовления </td>
          <td> 30% </td>
          <td> 100% </td>
          <td> 60% </td>
          <td> 50% </td>
        </tr>

        <tr>
          <td> Стоимость изготовления лота, руб (Без НДС) </td>
          <td>
            <p>3,700 руб.</p>
            <p>-25,000 руб.</p>
            <p>2,475,000 руб.</p>
          </td>
          <td>
            <p>3,200 руб.</p>
            <p>-25,000 руб.</p>
            <p>2,475,000 руб.</p>
          </td>
          <td>
            <p>3,800 руб.</p>
            <p>-25,000 руб.</p>
            <p>2,475,000 руб.</p>
          </td>
          <td>
            <p>3,800 руб.</p>
            <p>-25,000 руб.</p>
            <p>2,475,000 руб.</p>
          </td>
        </tr>

      </table>

      <p>Действия:</p>
    </div>
  );
}

export default App;
